try:
    a = int(input("Введіть бажану довжину пароля "))
    dig = float(input("Якщо ви хочете щоб в вашому паролі були цифри натисніть 1, інакше натисніть 0"))
    if (dig == 1):
        print("Гаразд, у вашому паролі будуть цифри")
    else:
        print("Error")
    low = float(input("Якщо ви хочете щоб в вашому паролі були маленькі літери натисніть 1, інакше натисніть 0"))
    if (low == 1):
        print("Гаразд, у вашому паролі будуть мфленькі літери")
    else:
        print("Error")
    upp = float(input("Якщо ви хочете щоб в вашому паролі були еликі літери натисніть 1, інакше натисніть 0"))
    if (upp == 1):
        print("Гаразд, у вашому паролі будуть великі літери")
    else:
        print("Error")
    sign = float(input("Якщо ви хочете щоб в вашому паролі були пеціальні символи 1, інакше натисніть 0"))
    if (sign == 1):
        print("Гаразд, у вашому паролі будуть спеціальні символи")
    else:
        print("Error")



    # if a > b:
    #     a, b = b, a
    # for i in range(a, b):
    #     if a % 7 == 0:
    #         print(a)
    #     # a += 1
except Exception as e:
    print(e)